//1、手机号:11位数字、都是以1开头的
//var reg = /^1\d{10}$/;
//2、真实姓名(中国):两到四位的汉字
//var reg = /^[\u4e00-\u9fa5]{2,4}$/;
//3、验证邮箱
//var reg = /^\w+((-\w+)|(\.\w+))*@[A-Za-z0-9]+((\.|-)[A-Za-z0-9]+)*\.[A-Za-z0-9]+$/;
//    zhou-xiao.tian@zhufeng-peixun.cn.com
//    ((-\w+)|(\.\w+))* //->-xiao .tian ->防止连续出现多次-/.
//    [A-Za-z0-9]+ "zhufeng"
//    ((\.|-)[A-Za-z0-9]+)* "-peixun" ".cn"
//    \.[A-Za-z0-9]+ .com
//4、验证有效数字的
//0 -12 -12.3 -12.0 12.3 12.0
//->可能出现"-"也可能不出现,出现的话只能出现一次
//->整数部分是一到多个数字,但是两位数及以上的话不能以0开头
//->小数部分可能有可能没有,一但有必须是 .后面跟一位或者多位数字
//var reg = /^-?(\d|([1-9]\d+))(\.\d+)?$/;
//5、年龄:18-65之间
//18-19  /^1(8|9)$/
//20-59  /^[2-5]\d$/
//60-65  /^6[0-5]$/
//var reg = /^((18|19)|([2-5]\d)|(6[0-5]))$/;
//6、百度密码:长度为6~14个字符、支持数字,大小写字母和标点符号
//var reg = /^(\w|-|#|@|\*|\.|&|!|\?|;|:|~|,|%|^|\+){6,14}$/;
//百度的正则：
//手机号：/^1[34578]\d{9}$/
//邮箱：/^([a-zA-Z0-9_\.\-\+])+\@(([a-zA-Z0-9\-])+\.)+([a-zA-Z0-9]{2,4})+$/
//7、身份证号码的:一共18位,最后一位可能是数字可能是X
//var reg = /^[1-9]\d{16}(\d|X)$/;
//->13 0828 1990 12 04 06 1 7
//->13 0626 1990 03 15 28 6 7
var reg = /^(\d{6})(\d{4})(\d{2})(\d{2})(\d{2})(\d)(\d|X)$/;
//->分组的第三个作用:分组捕获 在使用exec捕获的时候,不仅仅的把大正则匹配的内容捕获到了,而且把里面每一个分组匹配的内容单独的捕获到了
//->console.log(reg.exec("130828199012040617"));//->["130828199012040617"(大正则捕获的内容), "130828"(第一个分组捕获的内容), "1990", "12", "04", "06", "1", "7", index: 0(大正则捕获的开始索引位置), input: "130828199012040617"(捕获的原始字符串)]
//->写了分组但是不想捕获的时候捕获到,我们在分组的前面加"?:"->只匹配不捕获
reg = /^(\d{6})(\d{4})(\d{2})(\d{2})(?:\d{2})(\d)(?:\d|X)$/;
console.log(reg.exec("130828199012040617"));//->ary=["130828199012040617", "130828", "1990", "12", "04", "1"...]